## Week 11a: SQLite database

In [1]:
import sqlite3
import csv

#### Establish a connection

In [3]:
con = sqlite3.connect('School.db')#, autocommit=False) # If there is no database, it will create a new database of that name
cursor = con.cursor()

#### Create a table

In [4]:
create_table = """CREATE TABLE students(
                        id INTEGER PRIMARY KEY,
                        fname TEXT,
                        lname TEXT);
                """

cursor.execute(create_table)

#### Insert data

In [5]:
cursor.execute("INSERT INTO students VALUES (387423, 'Patrick', 'Ramos')")

#### Query the table

In [6]:
results = cursor.execute("SELECT * FROM students") # This one is iterable

for res in results:
    print(res)

(387423, 'Patrick', 'Ramos')

In [7]:
results = cursor.execute("SELECT * FROM students").fetchall()
results

[(387423, 'Patrick', 'Ramos')]

#### Close the connection

In [8]:
con.close()

In [9]:
results = cursor.execute("SELECT * FROM students").fetchall()
results

ProgrammingError: Cannot operate on a closed database.

#### Reestablish connection

In [11]:
new_con = sqlite3.Connection('School.db')#, autocommit=False)
new_cursor = new_con.cursor()

In [12]:
results = new_cursor.execute("SELECT * FROM students").fetchall()
results

[]

In [13]:
new_con.close()

#### Redo with `commit`

In [14]:
new_con = sqlite3.Connection('School.db')#, autocommit=False)
new_cursor = new_con.cursor()

In [15]:
new_cursor.execute("INSERT INTO students VALUES (387423, 'Patrick', 'Ramos')")

In [17]:
new_con.commit()

In [18]:
new_con.close()

In [ ]:
# Reopeoning the connection

In [19]:
new_con = sqlite3.Connection('School.db')#, autocommit=False)
new_cursor = new_con.cursor()

In [20]:
results = new_cursor.execute("SELECT * FROM students").fetchall()
results

[(387423, 'Patrick', 'Ramos')]

#### Check if something is in process

In [22]:
new_con.in_transaction

False

In [23]:
new_con.total_changes

0

#### Insert data from csv

In [28]:
with open("students_1.csv") as f:
    data = csv.reader(f)
    for row in data:
        print(row)

['fname', 'lname', 'ID']
['Patrick', 'Ramos', '387423']
['Walter', 'King', '657953']
['Margaret', 'Brooks', '264676']
['Betty', 'Murphy', '705400']
['Pamela', 'Campbell', '399844']
['Victoria', 'Lee', '669408']
['Samantha', 'Peterson', '211134']
['Judith', 'Mendoza', '518833']
['Emily', 'Reed', '962205']
['Justin', 'Kelly', '660198']

In [30]:
con = sqlite3.connect('School.db')#, autocommit=False) # If there is no database, it will create a new database of that name
cursor = con.cursor()

In [31]:
with open("students_1.csv") as f:
    data = csv.reader(f)
    for row in data:
        if row[0]=='fname':
            continue
        cursor.execute("INSERT INTO students VALUES (?, ?, ?)", (int(row[2]), row[0], row[1]))# Instead of values we shall give question mark and give them as a tuple.
        # This method is mainly to avoid sql injection.

IntegrityError: UNIQUE constraint failed: students.id

In [32]:
drop_table = """DROP TABLE students"""
cursor.execute(drop_table)
con.commit()

In [33]:
create_table = """CREATE TABLE students(
                        id INTEGER PRIMARY KEY,
                        fname TEXT,
                        lname TEXT);
                """

cursor.execute(create_table)

In [35]:
with open("students_1.csv") as f:
    data = csv.reader(f)
    for row in data:
        if row[0]=='fname':
            continue
        cursor.execute("INSERT INTO students VALUES (?, ?, ?)", (int(row[2]), row[0], row[1]))# Instead of values we shall give question mark and give them as a tuple.
        # This method is mainly to avoid sql injection.

In [36]:
results = cursor.execute("SELECT * FROM students").fetchall()
results

[(211134, 'Samantha', 'Peterson'),
 (264676, 'Margaret', 'Brooks'),
 (387423, 'Patrick', 'Ramos'),
 (399844, 'Pamela', 'Campbell'),
 (518833, 'Judith', 'Mendoza'),
 (657953, 'Walter', 'King'),
 (660198, 'Justin', 'Kelly'),
 (669408, 'Victoria', 'Lee'),
 (705400, 'Betty', 'Murphy'),
 (962205, 'Emily', 'Reed')]

In [37]:
con.commit()

In [38]:
con.close()

#### Delete database

Delete that file in the folder

### Exercises

 - recreate the database called `School` with a table called `students`; add the `students_1.csv` data back into the table
 - add the students in the `students_2.csv` file to the `students` table in the database
 - in the `School` database, create a new table called `marks` and add the data in the `marks.csv`file to it

In [2]:
import sqlite3
import csv

In [3]:
con = sqlite3.connect('School.db')
cursor = con.cursor()

In [4]:
create_table = """CREATE TABLE students(
                        id INTEGER PRIMARY KEY,
                        fname TEXT,
                        lname TEXT);
                """

cursor.execute(create_table)

In [6]:
cursor.execute("Select * from students").fetchall()

[]

In [7]:
with open("students_1.csv") as f:
    data = csv.reader(f)
    for row in data:
        if row[0]=='fname':
            continue
        cursor.execute("INSERT INTO students VALUES (?, ?, ?)", (int(row[2]), row[0], row[1]))

In [9]:
cursor.execute("Select * from students").fetchall()

[(211134, 'Samantha', 'Peterson'),
 (264676, 'Margaret', 'Brooks'),
 (387423, 'Patrick', 'Ramos'),
 (399844, 'Pamela', 'Campbell'),
 (518833, 'Judith', 'Mendoza'),
 (657953, 'Walter', 'King'),
 (660198, 'Justin', 'Kelly'),
 (669408, 'Victoria', 'Lee'),
 (705400, 'Betty', 'Murphy'),
 (962205, 'Emily', 'Reed')]

In [10]:
with open("students_2.csv") as f:
    data = csv.reader(f)
    for row in data:
        if row[0]=='fname':
            continue
        cursor.execute("INSERT INTO students VALUES (?, ?, ?)", (int(row[2]), row[0], row[1]))

In [12]:
cursor.execute("Select * from students").fetchall()

[(122942, 'Randy', 'Martinez'),
 (174267, 'Eugene', 'Hill'),
 (211134, 'Samantha', 'Peterson'),
 (223293, 'Russell', 'Williams'),
 (253798, 'Matthew', 'Collins'),
 (264676, 'Margaret', 'Brooks'),
 (329265, 'Deborah', 'Nguyen'),
 (380016, 'Tyler', 'Taylor'),
 (387423, 'Patrick', 'Ramos'),
 (399844, 'Pamela', 'Campbell'),
 (400412, 'Billy', 'Ortiz'),
 (518833, 'Judith', 'Mendoza'),
 (650755, 'John', 'Nguyen'),
 (657953, 'Walter', 'King'),
 (660198, 'Justin', 'Kelly'),
 (669408, 'Victoria', 'Lee'),
 (677895, 'Catherine', 'Cox'),
 (705400, 'Betty', 'Murphy'),
 (784736, 'Gary', 'Patel'),
 (962205, 'Emily', 'Reed')]

In [15]:
with open("marks.csv") as f:
    data = csv.reader(f)
    for row in data:
        print(row)

['ID', 'Test_1', 'Test_2', 'Test_3']
['387423', '31', '65', '76']
['657953', '38', '10', '75']
['264676', '26', '53', '58']
['705400', '12', '40', '69']
['399844', '3', '27', '80']
['669408', '4', '88', '90']
['211134', '80', '81', '55']
['518833', '32', '35', '29']
['962205', '58', '39', '74']
['660198', '69', '17', '12']
['122942', '58', '86', '77']
['223293', '75', '53', '60']
['329265', '91', '47', '42']
['174267', '95', '47', '79']
['650755', '76', '84', '22']
['380016', '1', '62', '61']
['677895', '20', '57', '89']
['253798', '17', '88', '16']
['400412', '87', '39', '86']
['784736', '8', '30', '74']

In [16]:
create_table = """CREATE TABLE marks(
                        ID INTEGER PRIMARY KEY,
                        TEST_1 INTEGER,
                        Test_2 INTEGER,
                        Test_3 INTEGER);
                """

cursor.execute(create_table)

In [18]:
cursor.execute("Select * from marks").fetchall()

[]

In [21]:
with open("marks.csv") as f:
    data = csv.reader(f)
    for row in data:
        if row[0]=='ID':
            continue
        cursor.execute("INSERT INTO marks VALUES (?, ?, ?,?)", (int(row[0]), int(row[1]), int(row[2]), int(row[3])))

In [23]:
cursor.execute("Select * from marks").fetchall()

[(122942, 58, 86, 77),
 (174267, 95, 47, 79),
 (211134, 80, 81, 55),
 (223293, 75, 53, 60),
 (253798, 17, 88, 16),
 (264676, 26, 53, 58),
 (329265, 91, 47, 42),
 (380016, 1, 62, 61),
 (387423, 31, 65, 76),
 (399844, 3, 27, 80),
 (400412, 87, 39, 86),
 (518833, 32, 35, 29),
 (650755, 76, 84, 22),
 (657953, 38, 10, 75),
 (660198, 69, 17, 12),
 (669408, 4, 88, 90),
 (677895, 20, 57, 89),
 (705400, 12, 40, 69),
 (784736, 8, 30, 74),
 (962205, 58, 39, 74)]

In [25]:
con.commit()

In [27]:
cursor.execute("Select * from marks").fetchall()

[(122942, 58, 86, 77),
 (174267, 95, 47, 79),
 (211134, 80, 81, 55),
 (223293, 75, 53, 60),
 (253798, 17, 88, 16),
 (264676, 26, 53, 58),
 (329265, 91, 47, 42),
 (380016, 1, 62, 61),
 (387423, 31, 65, 76),
 (399844, 3, 27, 80),
 (400412, 87, 39, 86),
 (518833, 32, 35, 29),
 (650755, 76, 84, 22),
 (657953, 38, 10, 75),
 (660198, 69, 17, 12),
 (669408, 4, 88, 90),
 (677895, 20, 57, 89),
 (705400, 12, 40, 69),
 (784736, 8, 30, 74),
 (962205, 58, 39, 74)]